#include "peo.c" 
//赋值函数3
void map_assignin3(char map[SIZEX][SIZEY],struct people peo[])		//这里定义的map为形参 
{	int back=0;
	int i,j,x,y;
	setcolor(13,0);
	printf("\t\t\t\t第 %d 块地图\n",mapmark);
	printf("\t\t\t按F2输入作弊码\n");
	Sleep (1000);
	system("cls");
	for(i=0;i<SIZEX;i++)										//地图初始化为0 
		{for(j=0;j<SIZEY;j++)
			{
		 		map[i][j]=' ';
			}
		}
	 
	for(j=0;j<18;j++,j++) 									//上边界
		{
		 	map[0][j]=-88;
		 	map[0][j+1]=-128;
		}
	 
	for(j=0;j<18;j++,j++)									//下边界
		{
		 	map[SIZEX-1][j]=-88;
		 	map[SIZEX-1][j+1]=-128;
		}
	
	for(i=0;i<SIZEX;i++)										//左边界
		{
		 	map[i][0]=-88;
		 	map[i][1]=-128;
		} 
	
	for(i=0;i<SIZEX;i++)										//右边界
		{
		 	map[i][18]=-88;
		 	map[i][19]=-128;
		} 
	for(j=4;j<16;j++,j++) 									//上边界
		{
		 	map[5][j]=-88;
		 	map[5][j+1]=-128;
		}
			map[2][10]=-88;
		 	map[2][11]=-128;
		 	map[2][12]=-88;
		 	map[2][13]=-128;
		 	map[2][14]=-88;
		 	map[2][15]=-128;
		 	map[2][6]=-88;
		 	map[2][7]=-128;
		 	map[3][6]=-88;
		 	map[3][7]=-128;
		 	map[3][4]=-88;
		 	map[3][5]=-128;
		 	map[6][4]=-88;
		 	map[6][5]=-128;
		 	map[7][4]=-88;
		 	map[7][5]=-128;
		 	map[7][14]=-88;
		 	map[7][15]=-128;
		 	map[8][14]=-88;
		 	map[8][15]=-128;
		 	map[3][12]=-88;
		 	map[3][13]=-128;
		 	
			map[6][8]=-71;											//怪物初始赋值，怪物初始化位置
			map[6][9]=-42;		
			map[8][4]=-71;										
			map[8][5]=-42;
			map[7][10]=-71;										
			map[7][11]=-42;
			map[5][16]=-71;										
			map[5][17]=-42;
			map[5][2]=-71;										
			map[5][3]=-42;
			map[3][2]=-71;										
			map[3][3]=-42;
			
			map[1][8]=-69;			//虎							
			map[1][9]=-94;
			map[4][12]=-69;										
			map[4][13]=-94;
			
			map[1][16]=-49;			//象							
			map[1][17]=-13;
			map[4][6]=-49;										
			map[4][7]=-13;
			map[6][14]=-49;										
			map[6][15]=-13;
			
			map[8][12]=-95;//攻										
			map[8][13]=-8;
			map[1][2]=-95;//攻										
			map[1][3]=-8;
			map[8][16]=-95;									
			map[8][17]=-8;
			map[3][10]=-95;									
			map[3][11]=-8;
			
			map[8][8]=-95;											//血初始赋值，血初始化位置
			map[8][9]=-12;
			map[2][4]=-95;										
			map[2][5]=-12;
			map[3][14]=-95;										
			map[3][15]=-12;
			
			map[7][2]=-95;											//人物初始赋值，人物初始化位置
			map[7][3]=-30;

			map[7][0]=-61;											//门初始赋值，门初始化位置
			map[7][1]=-59;
			
			map[1][12]=-87;//王 	-51 -11  
			map[1][13]=73;
		
		map_put(map,peo);
		printf("你已经回不去了，勇敢前进吧\n");
		system("pause");
		system("cls");
		map[7][0]=-88;											
		map[7][1]=-128;
}
//墙	-88 -128
//怪	-71 -42 
//血	-95 -12
//攻	-95 -8
//人	-95 -30
//门	-95 -14
//王 	-87 73
//虎 	-69 -94
//象 	-49 -13
